Epoch 1/2
  1/100 [..............................] - ETA: 0s - loss: 4.6179 - mae: 1.6626  7/100 [=>............................] - ETA: 0s - loss: 3.1245 - mae: 1.3134 13/100 [==>...........................] - ETA: 0s - loss: 3.4182 - mae: 1.3568 20/100 [=====>........................] - ETA: 0s - loss: 3.3930 - mae: 1.3566 24/100 [======>.......................] - ETA: 0s - loss: 3.2667 - mae: 1.3298 31/100 [========>.....................] - ETA: 0s - loss: 3.1265 - mae: 1.2967 38/100 [==========>...................] - ETA: 0s - loss: 3.1282 - mae: 1.2880 44/100 [============>.................] - ETA: 0s - loss: 3.1722 - mae: 1.2963 51/100 [==============>...............] - ETA: 0s - loss: 3.2680 - mae: 1.3109 58/100 [================>.............] - ETA: 0s - loss: 3.2195 - mae: 1.3015 64/100 [==================>...........] - ETA: 0s - loss: 3.1699 - mae: 1.2962 70/100 [====================>.........] - ETA: 0s - loss: 3.1397 - mae: 1.2941 77/100 [======================>.......] - ETA: 0s - loss: 3.1501 - mae: 1.2992 83/100 [=======================>......] - ETA: 0s - loss: 3.1623 - mae: 1.3037 89/100 [=========================>....] - ETA: 0s - loss: 3.1751 - mae: 1.3097 95/100 [===========================>..] - ETA: 0s - loss: 3.1828 - mae: 1.3129100/100 [==============================] - 1s 9ms/step - loss: 3.1984 - mae: 1.3200
Epoch 2/2
  1/100 [..............................] - ETA: 0s - loss: 0.8390 - mae: 0.6500  7/100 [=>............................] - ETA: 0s - loss: 2.7988 - mae: 1.1973 13/100 [==>...........................] - ETA: 0s - loss: 3.0578 - mae: 1.2898 19/100 [====>.........................] - ETA: 0s - loss: 2.9690 - mae: 1.2870 26/100 [======>.......................] - ETA: 0s - loss: 2.9977 - mae: 1.3067 32/100 [========>.....................] - ETA: 0s - loss: 2.9277 - mae: 1.3079 38/100 [==========>...................] - ETA: 0s - loss: 2.8879 - mae: 1.2956 44/100 [============>.................] - ETA: 0s - loss: 2.8741 - mae: 1.2860 50/100 [==============>...............] - ETA: 0s - loss: 2.9054 - mae: 1.2920 56/100 [===============>..............] - ETA: 0s - loss: 2.9753 - mae: 1.3074 62/100 [=================>............] - ETA: 0s - loss: 2.9947 - mae: 1.3111 68/100 [===================>..........] - ETA: 0s - loss: 3.0131 - mae: 1.3180 74/100 [=====================>........] - ETA: 0s - loss: 3.0088 - mae: 1.3216 80/100 [=======================>......] - ETA: 0s - loss: 3.0608 - mae: 1.3292 86/100 [========================>.....] - ETA: 0s - loss: 3.0331 - mae: 1.3289 92/100 [==========================>...] - ETA: 0s - loss: 3.0964 - mae: 1.3346 98/100 [============================>.] - ETA: 0s - loss: 3.0962 - mae: 1.3339100/100 [==============================] - 1s 9ms/step - loss: 3.1022 - mae: 1.3331
Model: "my_model"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
flatten (Flatten)            multiple                  0         
_________________________________________________________________
dense (Dense)                multiple                  604       
_________________________________________________________________
dense_1 (Dense)              multiple                  10        
=================================================================
Total params: 614
Trainable params: 614
Non-trainable params: 0
_________________________________________________________________
